In [5]:
from pandas import DataFrame
df = DataFrame(
                [
                    [19,14,18,19],
                    [18,10,17,16],
                    [17,16,18,15]
                    
                ],columns=['osa','java','se','ds']
              )
df

   osa  java  se  ds
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [6]:
df.sum()

osa     54
java    40
se      53
ds      50
dtype: int64

In [8]:
df.max()

osa     19
java    16
se      18
ds      19
dtype: int64

In [10]:
df.min()

osa     17
java    10
se      17
ds      15
dtype: int64

In [11]:
df.mean()

osa     18.000000
java    13.333333
se      17.666667
ds      16.666667
dtype: float64

In [12]:
df.count()

osa     3
java    3
se      3
ds      3
dtype: int64

In [19]:
df.agg(['sum','max','min'])

     osa  java  se  ds
sum   54    40  53  50
max   19    16  18  19
min   17    10  17  15

In [17]:
df.describe()

        osa       java         se         ds
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [20]:
df.agg(['sum','max','min','std'])

      osa      java        se         ds
sum  54.0  40.00000  53.00000  50.000000
max  19.0  16.00000  18.00000  19.000000
min  17.0  10.00000  17.00000  15.000000
std   1.0   3.05505   0.57735   2.081666

In [21]:
df.prod()

osa     5814
java    2240
se      5508
ds      4560
dtype: int64

In [22]:
df.median()

osa     18.0
java    14.0
se      18.0
ds      16.0
dtype: float64

In [36]:
from pandas import DataFrame
df1 = DataFrame(
                    [
                        ['aryan','singh','full-time','administration',2,20000],
                        ['rohan','agarwal','intern','technical',3,5000],
                        ['riya','shah','full-time','administration',5,10000],
                        ['yash','bhatia','part-time','technical',7,10000],
                        ['sidhant','khanna','full-time','management',6,20000],
                        
                    ],columns=['Frist Name','Last Name','Type','Department','yoE','Salary']
             )
df1

  Frist Name Last Name       Type      Department  yoE  Salary
0      aryan     singh  full-time  administration    2   20000
1      rohan   agarwal     intern       technical    3    5000
2       riya      shah  full-time  administration    5   10000
3       yash    bhatia  part-time       technical    7   10000
4    sidhant    khanna  full-time      management    6   20000

In [34]:
df1.groupby(['Type']).sum()

           yoE  Salary
Type
full-time   13   50000
intern       3    5000
part-time    7   10000

In [35]:
df1.groupby(['Type']).mean()

                yoE        Salary
Type
full-time  4.333333  16666.666667
intern     3.000000   5000.000000
part-time  7.000000  10000.000000

In [39]:
df1.groupby(['Type','Department']).sum()

                          yoE  Salary
Type      Department
full-time administration    7   30000
          management        6   20000
intern    technical         3    5000
part-time technical         7   10000